IRP/src/Documents/DebitCreditNote/DebitCreditNote.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>DebitCreditNote</name>
  <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
  <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
  <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
  <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
  <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
  <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
  <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
  <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
  <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
  <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
  <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
  <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
  <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
  <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveBranch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>SendPartner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SendAgreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLegalNameContract</name>
    <type>
      <types>CatalogRef.LegalNameContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>SendProject</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>SendDebtType</name>
    <type>
      <types>EnumRef.DebtTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SendOrder</name>
    <type>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>SendBasisDocument</name>
    <type>
      <types>DefinedType.typeApArTransactionBasises</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivePartner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveAgreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLegalNameContract</name>
    <type>
      <types>CatalogRef.LegalNameContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveProject</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveDebtType</name>
    <type>
      <types>EnumRef.DebtTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveOrder</name>
    <type>
      <types>DocumentRef.PurchaseOrder</types>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveBasisDocument</name>
    <type>
      <types>DefinedType.typeApArTransactionBasises</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DELETE_Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>LossCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>RevenueType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProfitCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransitUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.SalesReturn</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/DebtTypes/DebtTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DebtTypes</name>
  <enumValues>
    <name>AdvanceVendor</name>
  </enumValues>
  <enumValues>
    <name>TransactionVendor</name>
  </enumValues>
  <enumValues>
    <name>AdvanceCustomer</name>
  </enumValues>
  <enumValues>
    <name>TransactionCustomer</name>
  </enumValues>
  <enumValues>
    <name>DELETE_OtherPartnerPayable</name>
  </enumValues>
  <enumValues>
    <name>OtherPartnerReceivable</name>
  </enumValues>
  <enumValues>
    <name>DELETE_EmployeePayable</name>
  </enumValues>
  <enumValues>
    <name>EmployeeReceivable</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Documents/DebitCreditNote/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
		
	If Not ValueIsFilled(ThisObject.SendUUID) Then
		ThisObject.SendUUID = New UUID();
	EndIf;
	
	If Not ValueIsFilled(ThisObject.ReceiveUUID) Then
		ThisObject.ReceiveUUID = New UUID();
	EndIf;

	If Not ValueIsFilled(ThisObject.TransitUUID) Then
		ThisObject.TransitUUID = New UUID();
	EndIf;
	
	TotalTable = New ValueTable();
	TotalTable.Columns.Add("Key");
	TotalTable.Add().Key = ThisObject.SendUUID;
	TotalTable.Add().Key = ThisObject.ReceiveUUID;
	TotalTable.Add().Key = ThisObject.TransitUUID;
	
	If CurrenciesServer.NeedUpdateCurrenciesTable(ThisObject) Then
		
		CurrenciesClientServer.DeleteUnusedRowsFromCurrenciesTable(ThisObject.Currencies, TotalTable);
		
		Parameters = CurrenciesClientServer.GetParameters_V7(ThisObject, ThisObject.SendUUID, ThisObject.SendCurrency, 
			ThisObject.SendAmount, ThisObject.SendAgreement);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, ThisObject.SendUUID);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
		
		AmountsInfo = CurrenciesClientServer.GetLocalTotalAountsInfo();	
		AmountsInfo.TotalAmount.Value = ThisObject.SendAmount;
		AmountsInfo.TotalAmount.Name  = "SendLocalTotalAmount";
		AmountsInfo.LocalRate.Name    = "SendLocalRate";
		TotalAmounts = CurrenciesServer.GetLocalTotalAmounts(ThisObject, Parameters, AmountsInfo);
		CurrenciesServer.UpdateLocalTotalAmounts(ThisObject, TotalAmounts, AmountsInfo);
		
		Parameters = CurrenciesClientServer.GetParameters_V7(ThisObject, ThisObject.ReceiveUUID, ThisObject.ReceiveCurrency, 
			ThisObject.ReceiveAmount, ThisObject.ReceiveAgreement);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, ThisObject.ReceiveUUID);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
		
		AmountsInfo = CurrenciesClientServer.GetLocalTotalAountsInfo();	
		AmountsInfo.TotalAmount.Value = ThisObject.ReceiveAmount;
		AmountsInfo.TotalAmount.Name  = "ReceiveLocalTotalAmount";
		AmountsInfo.LocalRate.Name    = "ReceiveLocalRate";
		TotalAmounts = CurrenciesServer.GetLocalTotalAmounts(ThisObject, Parameters, AmountsInfo);
		CurrenciesServer.UpdateLocalTotalAmounts(ThisObject, TotalAmounts, AmountsInfo);
					
		Parameters = CurrenciesClientServer.GetParameters_V7(ThisObject, ThisObject.TransitUUID, ThisObject.Currency, ThisObject.SendAmount);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, ThisObject.TransitUUID);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
			
	EndIf;
	
	ThisObject.AdditionalProperties.Insert("WriteMode", WriteMode);
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	WriteMode = CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "WriteMode");
	If FOServer.IsUseAccounting() And WriteMode = DocumentWriteMode.Posting Then
		AccountingServer.OnWrite(ThisObject, Cancel);
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.SendCurrency = ThisObject.ReceiveCurrency
		And ThisObject.SendAmount <> ThisObject.ReceiveAmount Then
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_148, "SendAmount", ThisObject);
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_148, "ReceiveAmount", ThisObject);
		Cancel = True;
	EndIf;
	
	If ThisObject.SendDebtType <> Enums.DebtTypes.EmployeeReceivable And FOServer.IsUseLegalName() Then
		CheckedAttributes.Add("SendLegalName");
	EndIf;
	
	If ThisObject.ReceiveDebtType <> Enums.DebtTypes.EmployeeReceivable And FOServer.IsUseLegalName() Then
		CheckedAttributes.Add("ReceiveLegalName");
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") Then
			ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingData);
			Filling_BasedOn(FillingData);
		EndIf;
	EndIf;
EndProcedure

Procedure Filling_BasedOn(FillingData)
	FillPropertyValues(ThisObject, FillingData);
EndProcedure
